Repository: SideStore/StosVPN
Catalog: StosVPN/Localization/*.lproj/Localizable.strings
Languages: fr, zh

source: Disconnected
fr: Déconnecté
zh: 已断开

source: Connecting
fr: Connexion
zh: 连接中

source: Connected
fr: Connecté
zh: 已连接

source: Disconnecting
fr: Déconnexion
zh: 断开中

source: Error
fr: Erreur
zh: 错误

source: Local Tunnel Active
fr: Tunnel local actif
zh: 本地隧道已激活

source: Local Tunnel Inactive
fr: Tunnel local inactif
zh: 本地隧道未激活

source: Connect
fr: Se connecter
zh: 连接

source: Disconnect
fr: Se déconnecter
zh: 断开

# connecting_ellipsis
source: Connecting...
fr: Connexion...
zh: 连接中...

# disconnecting_ellipsis
source: Disconnecting...
fr: Déconnexion...
zh: 断开中...

# server_address_name
source: StosVPN Local Tunnel
fr: Tunnel local StosVPN
zh: StosVPN 本地隧道

# local_tunnel_details
source: Tunnel Details
fr: Détails du tunnel
zh: 隧道详情

source: Time Connected
fr: Durée de connexion
zh: 连接时长

source: Status
fr: Statut
zh: 状态

source: Active
fr: Actif
zh: 活跃

source: Network Interface
fr: Interface réseau
zh: 网络接口

source: Local
zh: 本地

source: Assigned IP
fr: IP assignée
zh: 分配的IP

source: Connection Settings
fr: Paramètres de connexion
zh: 连接设置

source: Auto Connect on Launch
fr: Connexion automatique au lancement
zh: 启动时自动连接

source: Connection Logs
fr: Journaux de connexion
zh: 连接日志

source: Network Configuration
fr: Configuration réseau
zh: 网络配置

source: Device IP
fr: IP de l'appareil
zh: 设备IP

source: Tunnel IP
fr: IP du tunnel
zh: 隧道IP

source: Subnet Mask
fr: Masque de sous-réseau
zh: 子网掩码

source: App Information
fr: Informations sur l'App
zh: 应用信息

source: Privacy Policy
fr: Politique de confidentialité
zh: 隐私政策

source: Data Collection Policy
fr: Politique de collecte de données
zh: 数据收集政策

source: App Version
fr: Version de l'App
zh: 应用版本

source: Help and Support
fr: Aide et support
zh: 帮助与支持

source: Language
fr: Langue
zh: 语言设置

source: Settings
fr: Paramètres
zh: 设置

source: Done
fr: Valider
zh: 完成

# warning_alert
source: Warning
zh: 警告

# warning_message
source: Changing tunnel IP settings can disrupt your network connection. Proceed only if you are sure of what you are doing.
zh: 更改隧道IP设置可能会中断您的网络连接。只有在确定自己在做什么的情况下才能继续。

# understand_button
source: I Understand
zh: 我明白

# data_collection_policy_title
source: Data Collection Policy
fr: Politique de collecte des données
zh: 数据收集政策

source: No Data Collection
fr: Aucune collecte de données
zh: 不收集数据

# no_data_collection_description
source: StosVPN DOES NOT collect user data, traffic information, or browsing activity. This app creates a local network tunnel that stays entirely on your device.
fr: StosVPN NE collecte PAS les données utilisateur, les informations de trafic ou l'activité de navigation. Cette application crée un tunnel réseau local qui reste entièrement sur votre appareil.
zh: StosVPN 不收集用户数据、流量信息或浏览活动。此应用创建的本地网络隧道完全保留在您的设备上。

source: Local Processing Only
fr: Traitement local uniquement
zh: 仅本地处理

# local_processing_only_description
source: All network traffic and configurations are processed locally on your device. No information ever leaves the device or is transmitted over the Internet.
fr: Tout le trafic réseau et la configuration sont traités localement sur votre appareil. Aucune information ne quitte jamais l'appareil ni n'est transmise sur Internet.
zh: 所有网络流量和配置都在您的设备上本地处理。没有任何信息离开设备或通过互联网传输。

source: No Third Party Sharing
fr: Aucun partage avec des tiers
zh: 不与第三方共享

# no_third_party_sharing_description
source: Since we do not collect data, there is no sharing with third parties. We do not have analytics, tracking, or data collection mechanisms in this app.
fr: Puisque nous ne collectons aucune donnée, il n'y a pas de partage avec des tiers. Il n'y a pas d'analyses, de suivi ou de mécanismes de collecte de données dans cette application.
zh: 由于我们不收集数据，因此不会与第三方共享。我们在此应用中没有分析、跟踪或数据收集机制。

source: Why Use Network Permissions
fr: Pourquoi demander les autorisations réseau
zh: 为什么使用网络权限

# why_use_network_permissions_description
source: StosVPN requires network extension permissions to create a local network interface on your device. This is used exclusively for local development and testing.
fr: StosVPN nécessite des autorisations d'extension réseau pour créer une interface réseau locale sur votre appareil. Ceci est utilisé exclusivement pour le développement et les tests locaux.
zh: StosVPN 需要网络扩展权限才能在您的设备上创建本地网络接口。这专门用于本地开发和测试。

source: Our Promise
fr: Notre engagement
zh: 我们的承诺

# our_promise_description
source: We are committed to privacy and transparency. This app is designed for developers to test and connect to local servers with no privacy concerns.
fr: Nous nous engageons à respecter la confidentialité et la transparence. Cette application est conçue pour permettre aux développeurs de tester et de se connecter à des serveurs locaux sans aucune préoccupation de confidentialité.
zh: 我们致力于隐私和透明度。此应用专为开发人员设计，用于测试和连接到本地服务器，无隐私顾虑。

# data_collection_policy_nav
source: Data Collection
fr: Collecte des données
zh: 数据收集

# logs_nav
source: Logs
fr: Journaux
zh: 日志

# faq_header
source: Frequently Asked Questions
fr: Questions fréquentes
zh: 常见问题

# faq_q1
source: What does this app do?
fr: Que fait cette application?
zh: 这个应用做什么？

# faq_q1_a1
source: StosVPN creates a local network interface for development and testing. It does not route traffic through external servers: everything stays on the device.
fr: StosVPN crée une interface réseau locale pour le développement et les tests. Elle ne redirige pas le trafic via des serveurs externes: tout reste sur l'appareil.
zh: StosVPN 为开发和测试创建本地网络接口。它不通过外部服务器路由流量：一切都保留在设备上。

# faq_common_use_cases
source: Common use cases include:
fr: Cas d'utilisation courants:
zh: 常见用例包括：

# faq_case1
source: • Web app testing with local servers
fr: • Tests d'applications web avec des serveurs locaux
zh: • 使用本地服务器进行Web应用测试

# faq_case2
source: • Development and debugging of network features
fr: • Développement et débogage de fonctionnalités réseau
zh: • 网络功能的开发和调试

# faq_case3
source: • Accessing hosted local development environments
fr: • Accès à des environnements de développement locaux hébergés
zh: • 访问托管的本地开发环境

# faq_case4
source: • Testing apps that require specific network configurations
fr: • Tests d'applications nécessitant des configurations réseau spécifiques
zh: • 测试需要特定网络配置的应用

# faq_q2
source: Is it a traditional VPN?
fr: Est-ce un VPN traditionnel?
zh: 这是传统的VPN吗？

# faq_q2_a1
source: No, StosVPN is NOT a traditional VPN service. It does NOT:
fr: Non, StosVPN n'est PAS un service VPN traditionnel. Il:
zh: 不，StosVPN 不是传统的VPN服务。它不会：

# faq_q2_point1
source: • Route your traffic through external servers
fr: • NE redirige pas votre trafic via des serveurs externes
zh: • 通过外部服务器路由您的流量

# faq_q2_point2
source: • Provide privacy or anonymity for browsing
fr: • N'offre pas de confidentialité ou d'anonymat pour la navigation
zh: • 为浏览提供隐私或匿名性

# faq_q2_point3
source: • Connect to remote VPN servers
fr: • NE se connecte pas à des serveurs VPN distants
zh: • 连接到远程VPN服务器

# faq_q2_point4
source: • Encrypt or route your internet traffic
fr: • NE chiffre ni ne redirige votre trafic Internet
zh: • 加密或路由您的互联网流量

# faq_q2_a2
source: StosVPN only creates a local network interface to help developers connect to local services for development and testing.
fr: StosVPN crée uniquement une interface réseau locale pour permettre aux développeurs de se connecter à des services locaux à des fins de développement et de test.
zh: StosVPN 只创建本地网络接口，帮助开发人员连接到本地服务进行开发和测试。

# faq_q3
source: Why does the connection fail?
fr: Pourquoi la connexion échoue-t-elle?
zh: 为什么连接失败？

# faq_q3_a1
source: Connection failures may be due to system permissions, configuration errors, or iOS restrictions.
fr: Les échecs de connexion peuvent être dus à des autorisations système, à des erreurs de configuration ou à des restrictions iOS.
zh: 连接失败可能是由于系统权限、配置错误或iOS限制。

# faq_troubleshoot_header
source: Troubleshooting steps:
fr: Étapes de dépannage:
zh: 故障排除步骤：

# faq_troubleshoot1
source: • Make sure you have approved the network extension permission
fr: • Assurez-vous d'avoir approuvé l'autorisation d'extension réseau
zh: • 确保您已批准网络扩展权限

# faq_troubleshoot2
source: • Try restarting the app
fr: • Essayez de redémarrer l'application
zh: • 尝试重启应用

# faq_troubleshoot3
source: • Check if the IP configuration is valid
fr: • Vérifiez si la configuration IP est valide
zh: • 检查IP配置是否有效

# faq_troubleshoot4
source: • Restart the device if problems persist
fr: • Redémarrez l'appareil si les problèmes persistent
zh: • 如果问题持续存在，请重启设备

# faq_q4
source: Who is this app for?
fr: À qui s'adresse cette app?
zh: 这个应用适合谁？

# faq_q4_intro
source: StosVPN is primarily designed for:
fr: StosVPN est principalement destiné pour:
zh: StosVPN 主要为以下人员设计：

# faq_q4_case1
source: • Developers testing local web servers
fr: • Les développeurs testant des serveurs web locaux
zh: • 测试本地Web服务器的开发人员

# faq_q4_case2
source: • App developers testing network features
fr: • Les développeurs d'applications testant des fonctionnalités réseau
zh: • 测试网络功能的应用开发人员

# faq_q4_case3
source: • QA engineers testing apps in isolated environments
fr: • Les ingénieurs QA testant des applications en environnement isolé
zh: • 在隔离环境中测试应用的QA工程师

# faq_q4_case4
source: • Anyone needing access to local services on iOS
fr: • Toute personne ayant besoin d'accéder à des services locaux sur iOS
zh: • 任何需要在iOS上访问本地服务的人

# faq_q4_conclusion
source: This app is publicly available and useful for developers who need to test apps with network features on iOS.
fr: Cette app est publique et utile aux développeurs qui ont besoin de tester des applications avec des fonctionnalités réseau sur iOS.
zh: 此应用公开可用，对需要在iOS上测试具有网络功能的应用的开发人员很有用。

# business_model_header
source: Business Model
fr: Modèle économique
zh: 商业模式

# biz_q1
source: How does StosVPN work?
fr: Comment fonctionne StosVPN?
zh: StosVPN 如何工作？

# biz_q1_a1
source: StosVPN is a completely free app available to the public. There are no paid features, subscriptions, or in-app purchases.
fr: StosVPN est une app entièrement gratuite, disponible pour tous. Il n'y a aucune fonctionnalité payante, aucun abonnement ni achat intégré.
zh: StosVPN 是一个完全免费的公共应用。没有付费功能、订阅或应用内购买。

# biz_key_points_header
source: Key points of our model:
fr: Points clés de notre modèle:
zh: 我们模式的要点：

# biz_point1
source: • The app is not tied to any company or group
fr: • L'application n'est liée à aucune entreprise ou groupe
zh: • 该应用不隶属于任何公司或团体

# biz_point2
source: • Anyone can download and use the app from the App Store
fr: • N'importe qui peut télécharger et utiliser l'application depuis l'App Store
zh: • 任何人都可以从App Store下载和使用该应用

# biz_point3
source: • No account creation is required
fr: • Aucune création de compte n'est requise
zh: • 无需创建账户

# biz_point4
source: • All features are free for all users
fr: • Toutes les fonctionnalités sont gratuites pour tous les utilisateurs
zh: • 所有功能对所有用户免费

# biz_point5
source: • The app is developed and maintained as an open utility for the iOS community
fr: • L'application est développée et maintenue comme un utilitaire ouvert pour la communauté iOS
zh: • 该应用作为iOS社区的开放实用工具进行开发和维护

# app_info_header
source: App Information
fr: Informations sur l'App
zh: 应用信息

# requires_ios
source: Requires iOS 14.0 or later
fr: Nécessite iOS 16.0 ou version ultérieure
zh: 需要iOS 14.0或更高版本

# uses_network_extension
source: Uses Apple Network Extension APIs
fr: Utilise les API Network Extension d'Apple
zh: 使用Apple网络扩展API

# help_and_support_nav
source: Help & Support
fr: Aide & support
zh: 帮助与支持

# setup_welcome_title
source: Welcome to StosVPN
fr: Bienvenue sur StosVPN
zh: 欢迎使用StosVPN

# setup_welcome_description
source: A simple local network tunnel for developers
fr: Un tunnel réseau local simple pour les développeurs
zh: 为开发人员提供的简单本地网络隧道

# setup_welcome_details
source: StosVPN creates a local network interface for development, testing, and access to local servers. This app DOES NOT collect user data or route traffic through external servers.
fr: StosVPN crée une interface réseau locale pour le développement, les tests et l'accès à des serveurs locaux. Cette application NE collecte pas de données utilisateur et ne redirige pas le trafic via des serveurs externes.
zh: StosVPN 为开发、测试和访问本地服务器创建本地网络接口。此应用不收集用户数据或通过外部服务器路由流量。

# setup_why_title
source: Why Use StosVPN?
fr: Pourquoi utiliser StosVPN?
zh: 为什么使用StosVPN？

# setup_why_description
source: Perfect for iOS developers
fr: Parfait pour les développeurs iOS
zh: 非常适合iOS开发人员

# setup_why_details
source: • Access local web servers and development environments • Test apps requiring specific network configurations • Connect to local network services without complex setup • Create isolated testing environments
fr: • Accédez à des serveurs web locaux et à des environnements de développement • Testez des applications nécessitant des configurations réseau spécifiques • Connectez-vous à des services réseau locaux sans configuration complexe • Créez des environnements de test isolés
zh: • 访问本地Web服务器和开发环境 • 测试需要特定网络配置的应用 • 连接到本地网络服务而无需复杂设置 • 创建隔离的测试环境

# setup_easy_title
source: Easy to Use
fr: Facile à utiliser
zh: 易于使用

# setup_easy_description
source: Just one tap to connect
fr: Une seule pression pour se connecter
zh: 只需一次点击即可连接

# setup_easy_details
source: StosVPN is designed to be simple. Just tap the connect button to establish a local tunnel with preconfigured settings.
fr: StosVPN a été conçu pour être simple. Appuyez simplement sur le bouton de connexion pour établir un tunnel local avec des paramètres préconfigurés.
zh: StosVPN 设计简单。只需点击连接按钮即可使用预配置设置建立本地隧道。

# setup_privacy_title
source: Privacy Focused
fr: Respect de la vie privée
zh: 注重隐私

# setup_privacy_description
source: Your data stays on the device
fr: Vos données restent sur l'appareil
zh: 您的数据保留在设备上

# setup_privacy_details
source: StosVPN creates a local tunnel that does not route traffic through external servers. All traffic stays on your device, ensuring privacy and security. No data is collected or shared with third parties.
fr: StosVPN crée un tunnel local qui ne redirige pas le trafic via des serveurs externes. Tout le trafic reste sur votre appareil, garantissant confidentialité et sécurité. Aucune donnée n'est collectée ou partagée avec des tiers.
zh: StosVPN 创建的本地隧道不通过外部服务器路由流量。所有流量都保留在您的设备上，确保隐私和安全。不收集或与第三方共享任何数据。

# setup_nav
source: Setup
fr: Configuration
zh: 设置

# setup_get_started
source: Get Started
fr: Commencer
zh: 开始使用

# setup_next
source: Next
fr: Suivant
zh: 下一步

# setup_skip
source: Skip
fr: Ignorer
zh: 跳过

source: English
fr: Anglais

source: Spanish
fr: Espagnol

source: Italian
fr: Italien
